# прекалк - наше всё!

print({'2 1': 7, '3 1': 25, '3 2': 23, '4 1': 253, '4 2': 250, '4 3': 247, '5 1': 3121, '5 2': 3117,
     '5 3': 3113, '5 4': 3109, '6 1': 46651, '6 2': 46646, '6 3': 46641, '6 4': 46636, '6 5': 46631,
     '7 1': 823537, '7 2': 823531, '7 3': 823525, '7 4': 823519, '7 5': 823513, '7 6': 823507,
     '8 1': 16777209, '8 2': 16777202, '8 3': 16777195, '8 4': 16777188, '8 5': 16777181, '8 6': 16777174,
     '8 7': 16777167}[input()])

# d = {}
# for n in range(2, 9):
#     for k in range(1, n):
#         #n, k = map(int, input().split())
#         x = 1
#         while True:
#             t = x
#             for _ in range(n):
#                 if t % n != k:
#                     break
#                 t -= k
#                 t = t // n * (n-1)
#             else:
#                 if t % n == 0:
#                     d[(n, k)] = x
#                     break
#             x += 1
# print(d)

# for n in range(2, 9):
#     for k in range(1, n):
#         m = (n-1)/n
#         up = k * m * (1 - m**n) / (1 - m)
#         down = m**n
#         i = 1
#         x = int((up + i) / m**n)
#         while abs((x * down - up) - i) > 0.0001:
#             i += 1
#             x = int((up + i) / m**n)
#         if x != d[(n, k)]:
#             print(x, n, k)

